                                                 DATA WRANGLING II

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('realtor-data.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   status          100000 non-null  object
 1   bed             75050 non-null   float64
 2   bath            75112 non-null   float64
 3   acre_lot        85987 non-null   float64
 4   city            99948 non-null   object
 5   state           100000 non-null  object
 6   zip_code        99805 non-null   float64
 7   house_size      75082 non-null   float64
 8   prev_sold_date  28745 non-null   object
 9   price           100000 non-null  float64
dtypes: float64(6), object(4)
memory usage: 7.6+ MB

In [7]:
df_sum = pd.DataFrame(df.groupby(['state', 'city'])['price'].mean())

In [9]:
df_sum.index

MultiIndex([(   'Connecticut',       'Andover'),
            (   'Connecticut',       'Ashford'),
            (   'Connecticut',          'Avon'),
            (   'Connecticut',   'Barkhamsted'),
            (   'Connecticut',        'Berlin'),
            (   'Connecticut',     'Bethlehem'),
            (   'Connecticut',    'Bloomfield'),
            (   'Connecticut',        'Bolton'),
            (   'Connecticut',        'Bozrah'),
            (   'Connecticut',       'Bristol'),
            ...
            (       'Vermont',    'Whitingham'),
            (       'Vermont',    'Wilmington'),
            (       'Vermont',       'Winhall'),
            (       'Vermont',      'Woodford'),
            ('Virgin Islands', 'Christiansted'),
            ('Virgin Islands',  'Frederiksted'),
            ('Virgin Islands',     'Kingshill'),
            ('Virgin Islands',    'Saint John'),
            ('Virgin Islands',  'Saint Thomas'),
            (      'Virginia',  'Chincoteague')],
           names=['state', 'city'], length=582)

In [10]:
df_sum

                                    price
state          city
Connecticut    Andover       2.492542e+05
               Ashford       2.849269e+05
               Avon          6.070604e+05
               Barkhamsted   3.752788e+05
               Berlin        3.484531e+05
...                                   ...
Virgin Islands Frederiksted  7.014767e+05
               Kingshill     4.578320e+05
               Saint John    1.003303e+06
               Saint Thomas  1.169000e+06
Virginia       Chincoteague  7.500000e+04

[582 rows x 1 columns]

In [11]:
df_sum.stack()

state           city
Connecticut     Andover       price    2.492542e+05
                Ashford       price    2.849269e+05
                Avon          price    6.070604e+05
                Barkhamsted   price    3.752788e+05
                Berlin        price    3.484531e+05
                                           ...
Virgin Islands  Frederiksted  price    7.014767e+05
                Kingshill     price    4.578320e+05
                Saint John    price    1.003303e+06
                Saint Thomas  price    1.169000e+06
Virginia        Chincoteague  price    7.500000e+04
Length: 582, dtype: float64

In [12]:
df_stack = pd.DataFrame(df_sum.stack())

In [13]:
df_stack

                                              0
state          city
Connecticut    Andover      price  2.492542e+05
               Ashford      price  2.849269e+05
               Avon         price  6.070604e+05
               Barkhamsted  price  3.752788e+05
               Berlin       price  3.484531e+05
...                                         ...
Virgin Islands Frederiksted price  7.014767e+05
               Kingshill    price  4.578320e+05
               Saint John   price  1.003303e+06
               Saint Thomas price  1.169000e+06
Virginia       Chincoteague price  7.500000e+04

[582 rows x 1 columns]

In [14]:
df_stack.index

MultiIndex([(   'Connecticut',       'Andover', 'price'),
            (   'Connecticut',       'Ashford', 'price'),
            (   'Connecticut',          'Avon', 'price'),
            (   'Connecticut',   'Barkhamsted', 'price'),
            (   'Connecticut',        'Berlin', 'price'),
            (   'Connecticut',     'Bethlehem', 'price'),
            (   'Connecticut',    'Bloomfield', 'price'),
            (   'Connecticut',        'Bolton', 'price'),
            (   'Connecticut',        'Bozrah', 'price'),
            (   'Connecticut',       'Bristol', 'price'),
            ...
            (       'Vermont',    'Whitingham', 'price'),
            (       'Vermont',    'Wilmington', 'price'),
            (       'Vermont',       'Winhall', 'price'),
            (       'Vermont',      'Woodford', 'price'),
            ('Virgin Islands', 'Christiansted', 'price'),
            ('Virgin Islands',  'Frederiksted', 'price'),
            ('Virgin Islands',     'Kingshill', 'price'),
            ('Virgin Islands',    'Saint John', 'price'),
            ('Virgin Islands',  'Saint Thomas', 'price'),
            (      'Virginia',  'Chincoteague', 'price')],
           names=['state', 'city', None], length=582)

In [15]:
df.index

RangeIndex(start=0, stop=100000, step=1)

In [16]:
df_stack.index

MultiIndex([(   'Connecticut',       'Andover', 'price'),
            (   'Connecticut',       'Ashford', 'price'),
            (   'Connecticut',          'Avon', 'price'),
            (   'Connecticut',   'Barkhamsted', 'price'),
            (   'Connecticut',        'Berlin', 'price'),
            (   'Connecticut',     'Bethlehem', 'price'),
            (   'Connecticut',    'Bloomfield', 'price'),
            (   'Connecticut',        'Bolton', 'price'),
            (   'Connecticut',        'Bozrah', 'price'),
            (   'Connecticut',       'Bristol', 'price'),
            ...
            (       'Vermont',    'Whitingham', 'price'),
            (       'Vermont',    'Wilmington', 'price'),
            (       'Vermont',       'Winhall', 'price'),
            (       'Vermont',      'Woodford', 'price'),
            ('Virgin Islands', 'Christiansted', 'price'),
            ('Virgin Islands',  'Frederiksted', 'price'),
            ('Virgin Islands',     'Kingshill', 'price'),
            ('Virgin Islands',    'Saint John', 'price'),
            ('Virgin Islands',  'Saint Thomas', 'price'),
            (      'Virginia',  'Chincoteague', 'price')],
           names=['state', 'city', None], length=582)

In [17]:
df_stack.unstack()

                                        0
                                    price
state          city
Connecticut    Andover       2.492542e+05
               Ashford       2.849269e+05
               Avon          6.070604e+05
               Barkhamsted   3.752788e+05
               Berlin        3.484531e+05
...                                   ...
Virgin Islands Frederiksted  7.014767e+05
               Kingshill     4.578320e+05
               Saint John    1.003303e+06
               Saint Thomas  1.169000e+06
Virginia       Chincoteague  7.500000e+04

[582 rows x 1 columns]

In [19]:
df_ex = pd.DataFrame({'Valor1':[1,2,3,4],'Valor2':[5,6,7,8]})

In [20]:
df_ex.stack()

0  Valor1    1
   Valor2    5
1  Valor1    2
   Valor2    6
2  Valor1    3
   Valor2    7
3  Valor1    4
   Valor2    8
dtype: int64